[
    {
        "rating": "0/4",
        "name": "Roast Sausage and Fennel with Orange",
        "ingredients": [
            "2 medium fennel bulbs, fronds reserved, bulbs halved through root end, thinly sliced lengthwise",
            "1 small red onion, halved through root end, thinly sliced lengthwise",
            "3 sprigs rosemary",
            "4 Tbsp. extra-virgin olive oil, divided, plus more for drizzling",
            "Kosher salt, freshly ground pepper",
            "6 sweet Italian sausages (about 1 1/2 lb. total)",
            "1 medium navel orange",
            "1 Tbsp. red wine vinegar",
            "Flaky sea salt"
        ],
        "url": "https://www.epicurious.com/recipes/food/views/roast-sausage-and-fennel-with-orange",
        "yield": "4 servings ",
        "n_ratings": "0",
        "instructions": [
            "Place a rack in highest position in oven; preheat to 425°F. Combine fennel bulbs, red onion, and rosemary sprigs on a large rimmed baking sheet. Drizzle with 3 Tbsp. oil, season generously with kosher salt and pepper, and toss to combine. Arrange sausages on top, spacing evenly and nestling into vegetables. Prick sausages all over with the tip of a paring knife and drizzle with 1 Tbsp. oil. Roast until sausages are browned on top and cooked though and fennel is tender and deeply browned in spots, 25–30 minutes.",
            "Meanwhile, coarsely chop reserved fennel fronds (you want about 1/4 cup); set aside. Cut the ends off orange to reveal flesh. Rest orange upright on a cut side and cut down around orange to remove peel and white pith, rotating it as you go; discard peel. Working over a small bowl, hold orange in your hand and cut between membranes to release segments into bowl. Squeeze membranes to extract any remaining juice into bowl; discard membranes. Add vinegar to orange segments and juice and toss to combine; season with kosher salt and pepper.",
            "Remove baking sheet from oven. Using your hand or a spoon to block segments, pour juices from orange over sausage and fennel mixture. Set orange segments aside and let sausages and fennel mixture cool 5 minutes.",
            "Transfer sausages and fennel mixture to a platter. Crumble rosemary leaves over and scatter reserved orange segments and fennel fronds on top. Season with sea salt and a bit more pepper; drizzle with oil."
        ]
    }
]